from math import sin, radians, sqrt, cos
x = int(input("Введите число"))
b = int(input("Введите число"))
a = int(input("Введите число"))
c = int(input("Введите число"))
m = int(input("Введите число"))
n = int(input("Введите число"))

A = (f'А) -1/x^2 = {-1 / x ** 2}')
B = (f'Б) a / bc = {a / (b * c)}')
V = (f'В) (a / b) * c = {(a / b) * c}')
G = (f'Г) (a + b) / 2 = {(a + b) / 2}')
D = (f'Д) 5,45 * ((a + 2 * b) / (2 - a)) = {5.45 * (a + 2 * b) / (2 - a)}')
E = (f'Е) -b + koren b2 - 4ac / 2a = {-b + ((b ** 2 - (4 * a * c))) ** 0,5 / (2 * a)}')
ZH = (f'Ж) -b + 1/a / 2/c = \
      {-b + (1 / a) / (2 / c)}')
Z = (f'З) 1 / 1+ a + b / 2 = {1 / 1 + ((a + b) / 2)}')
I = (f'И) 1 / 1 + 1 / 2+ 1 / 2 + 3 / 5 = \
     {1 / 1 + 1 / 2+ 1 / 2 + 3 / 5}')
K = (f'К) 2^m^n = {(2 ** m) ** n}')

print(f'{A}, {B}, {V}, {G}, {D}, {E}, {ZH}, {Z}, {I}, {K}')
